[
  {
    "id": 1,
    "title": "Introduction to AI",
    "category": "Tutorial",
    "targetAudience": ["student", "graduate"],
    "link": "https://www.youtube.com/embed/F6B5y6f225M",
    "description": "A beginner-friendly overview of Artificial Intelligence, perfect for students and new graduates.",
    "transcript": "In this video, we explore the basics of AI and its impact on the modern world. We cover key concepts like machine learning, neural networks, and the different types of AI. This tutorial is perfect for anyone looking to start their journey into the world of artificial intelligence."
  },
  {
    "id": 2,
    "title": "Career Guidance Webinar",
    "category": "Webinar",
    "targetAudience": ["graduate", "professional"],
    "link": "https://www.youtube.com/embed/n4d8L62d294",
    "description": "Experts share insights on choosing the right career path, with a focus on job searching and professional growth.",
    "transcript": "Join us for this exclusive webinar where a panel of career experts discusses how to identify your strengths and passions. We'll cover topics like resume building, networking, and interview preparation. Discover tips and tricks to land your dream job."
  },
  {
    "id": 3,
    "title": "Data Science for Beginners",
    "category": "Tutorial",
    "targetAudience": ["student"],
    "link": "https://www.youtube.com/embed/ua-CiDNNj3o",
    "description": "Learn the fundamentals of data science in this comprehensive tutorial, tailored for students.",
    "transcript": "This video breaks down the complex field of data science into simple, understandable concepts. We'll walk you through the data analysis lifecycle, from data collection and cleaning to visualization and model building. No prior experience is necessary to follow along."
  },
  {
    "id": 4,
    "title": "Digital Marketing Masterclass",
    "category": "Seminar",
    "targetAudience": ["professional"],
    "link": "https://www.youtube.com/embed/1kYgVv1-h8w",
    "description": "A deep dive into strategies for effective online marketing, designed for working professionals.",
    "transcript": "In this masterclass, we explore the core pillars of a successful digital marketing strategy. Learn about SEO, content marketing, social media advertising, and email campaigns. We'll provide actionable tips you can use to grow your online presence immediately."
  },
  {
    "id": 5,
    "title": "Building a Portfolio",
    "category": "Workshop",
    "targetAudience": ["student", "graduate"],
    "link": "https://www.youtube.com/embed/qVvF5hXh4uU",
    "description": "Practical steps to create a standout portfolio, essential for students and recent graduates.",
    "transcript": "A strong portfolio is essential for showcasing your skills. This workshop provides a step-by-step guide to building a professional portfolio that will get you noticed by recruiters and clients. We cover how to select your best work, present your projects, and use storytelling to highlight your achievements."
  }
]